In [46]:
# IMPORTANT: RUN THIS CELL IN ORDER TO IMPORT YOUR KAGGLE DATA SOURCES,
# THEN FEEL FREE TO DELETE THIS CELL.
# NOTE: THIS NOTEBOOK ENVIRONMENT DIFFERS FROM KAGGLE'S PYTHON
# ENVIRONMENT SO THERE MAY BE MISSING LIBRARIES USED BY YOUR
# NOTEBOOK.
import kagglehub
durjoychandrapaul_house_price_bangladesh_path = kagglehub.dataset_download('durjoychandrapaul/house-price-bangladesh')

print('Data source import complete.')

Warning: Looks like you're using an outdated `kagglehub` version (installed: 0.3.6), please consider upgrading to the latest version (0.3.8).
Data source import complete.

In [47]:
!pip install --upgrade kagglehub

Requirement already satisfied: kagglehub in /usr/local/lib/python3.11/dist-packages (0.3.8)
Requirement already satisfied: packaging in /usr/local/lib/python3.11/dist-packages (from kagglehub) (24.2)
Requirement already satisfied: requests in /usr/local/lib/python3.11/dist-packages (from kagglehub) (2.32.3)
Requirement already satisfied: tqdm in /usr/local/lib/python3.11/dist-packages (from kagglehub) (4.67.1)
Requirement already satisfied: charset-normalizer<4,>=2 in /usr/local/lib/python3.11/dist-packages (from requests->kagglehub) (3.4.1)
Requirement already satisfied: idna<4,>=2.5 in /usr/local/lib/python3.11/dist-packages (from requests->kagglehub) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.11/dist-packages (from requests->kagglehub) (2.3.0)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.11/dist-packages (from requests->kagglehub) (2025.1.31)

For a detailed explanation and code interpretation, please visit the [GitHub repository](https://github.com/Mohsto/Real-Estate-Price-Prediction-in-Bangladesh).

# Importing libraries

In [45]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

# Reading the dataset

In [46]:
df = pd.read_csv("D:\\camera photos\\suhi apur reception\\archive\\house_price_bd.csv")

In [47]:
df.head()

,Title,Bedrooms,Bathrooms,Floor_no,Occupancy_status,Floor_area,City,Price_in_taka,Location
0,We Are Offering You A Very Spacious 1960 Sq Ft...,3.0,4.0,3,vacant,1960.0,dhaka,"৳39,000,000","Gulshan 1, Gulshan"
1,Valuable 1705 Square Feet Apartment Is Ready T...,3.0,3.0,1,vacant,1705.0,dhaka,"৳16,900,000","Lake Circus Road, Kalabagan"
2,1370 square feet apartment is ready to sale in...,3.0,3.0,6,vacant,1370.0,dhaka,"৳12,500,000","Shukrabad, Dhanmondi"
3,2125 Square Feet Apartment For Sale In Bashund...,3.0,3.0,4,vacant,2125.0,dhaka,"৳20,000,000","Block L, Bashundhara R-A"
4,Buy This 2687 Square Feet Flat In The Nice Are...,3.0,3.0,4,vacant,2687.0,dhaka,"৳47,500,000","Road No 25, Banani"

In [48]:
df.shape

(3865, 9)

In [49]:
df.describe()

          Bedrooms    Bathrooms     Floor_area
count  2864.000000  2864.000000    3766.000000
mean      3.133031     2.992668    1940.299522
std       2.215457     0.978434    6024.921935
min       1.000000     1.000000      84.000000
25%       3.000000     3.000000    1100.000000
50%       3.000000     3.000000    1380.000000
75%       3.000000     3.000000    1860.000000
max      50.000000    10.000000  195840.000000

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3865 entries, 0 to 3864
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Title             3865 non-null   object
 1   Bedrooms          2864 non-null   float64
 2   Bathrooms         2864 non-null   float64
 3   Floor_no          3181 non-null   object
 4   Occupancy_status  3766 non-null   object
 5   Floor_area        3766 non-null   float64
 6   City              3865 non-null   object
 7   Price_in_taka     3865 non-null   object
 8   Location          3859 non-null   object
dtypes: float64(3), object(6)
memory usage: 271.9+ KB

<a id="Section-one" ></a>
# Data cleaning

## Duplicates

In [51]:
df_clean = df.copy()

In [52]:
df_clean.duplicated().sum()

934

In [53]:
df_clean.drop_duplicates(inplace = True)

In [54]:
df_clean.shape

(2931, 9)

## Missing data

In [55]:
df_clean.isna().sum()

Title                 0
Bedrooms            831
Bathrooms           831
Floor_no            575
Occupancy_status     89
Floor_area           89
City                  0
Price_in_taka         0
Location              6
dtype: int64

### Fixing the Floor number column, in order to deal with the missing values

#### Fixing this column first to clarify also the confusion of floor number

In [56]:
df_clean["Floor_no"].value_counts()

Floor_no
1                       379
4                       306
5                       293
2                       274
3                       261
6                       249
7                       200
8                       184
9                       126
10                       23
11                       20
12                       16
13                        7
Merin City - Purbach      6
14                        2
1st                       1
8th                       1
A1,A2,A3,A4,A5,A6,A7      1
0+7                       1
1F                        1
4th to 8th Backside       1
18                        1
5th                       1
17                        1
G+7                       1
Name: count, dtype: int64

#### Starting with rows contains "Merin City - Purbach"

In [57]:
df_clean[df_clean["Floor_no"] == "Merin City - Purbach"]

,Title,Bedrooms,Bathrooms,Floor_no,Occupancy_status,Floor_area,City,Price_in_taka,Location
3313,Plot For Sale In A Suitable Place In Bproperty...,NaN,NaN,Merin City - Purbach,vacant,2160.0,narayanganj-city,"৳4,575,000","Rupganj, Narayanganj"
3388,"For Sale, Residential Plot Is Situated In Bpro...",NaN,NaN,Merin City - Purbach,vacant,2160.0,narayanganj-city,"৳4,575,000","Rupganj, Narayanganj"
3392,Plot For Sale In A Suitable Place In Bproperty...,NaN,NaN,Merin City - Purbach,vacant,2160.0,narayanganj-city,"৳4,575,000","Rupganj, Narayanganj"
3393,Plot For Sale In A Suitable Place In Bproperty...,NaN,NaN,Merin City - Purbach,vacant,2160.0,narayanganj-city,"৳4,575,000","Rupganj, Narayanganj"
3432,In The Beautiful Location Of Bproperty Village...,NaN,NaN,Merin City - Purbach,vacant,2160.0,narayanganj-city,"৳4,575,000","Rupganj, Narayanganj"
3492,Plot For Sale In A Suitable Place In Narayanga...,NaN,NaN,Merin City - Purbach,vacant,2160.0,narayanganj-city,"৳4,575,000","Rupganj, Narayanganj"

#### Dropping these rows as these are Plots for sale not apartments or flats

In [58]:
df_clean = df_clean[df_clean['Floor_no'] != 'Merin City - Purbach']

#### Moving to where we have "4th to 8th Backside"

In [59]:
df_clean[df_clean['Floor_no'] == '4th to 8th Backside']

,Title,Bedrooms,Bathrooms,Floor_no,Occupancy_status,Floor_area,City,Price_in_taka,Location
2674,An Apartment Is Up For Sale In Dakshin Kattali...,3.0,3.0,4th to 8th Backside,vacant,1250.0,chattogram,"৳3,800,000","Dakshin Kattali, 11 No. South Kattali Ward"

#### We can see that these are apartments, so i created 4 new rows, each row contains a floor number for each apartment

In [60]:
# Rows to replace (indices where 'Floor_no' contains '4th to 8th Backside')
rows_to_replace = df_clean[df_clean['Floor_no'] == '4th to 8th Backside']

# Create new rows for each floor from 4 to 8
new_rows = []
for i in range(4, 9):  # Floors from 4 to 8
    for index, row in rows_to_replace.iterrows():
        new_row = row.copy()
        new_row['Floor_no'] = i  # Set the floor number as a numeric value
        new_rows.append(new_row)

# Convert the list of new rows to a DataFrame
new_rows_df = pd.DataFrame(new_rows)

# Remove the original rows
df_clean = df_clean.drop(rows_to_replace.index)

# Use pd.concat() to append the new rows to the DataFrame
df_clean = pd.concat([df_clean, new_rows_df], ignore_index=True)

In [61]:
new_rows_df

,Title,Bedrooms,Bathrooms,Floor_no,Occupancy_status,Floor_area,City,Price_in_taka,Location
2674,An Apartment Is Up For Sale In Dakshin Kattali...,3.0,3.0,4,vacant,1250.0,chattogram,"৳3,800,000","Dakshin Kattali, 11 No. South Kattali Ward"
2674,An Apartment Is Up For Sale In Dakshin Kattali...,3.0,3.0,5,vacant,1250.0,chattogram,"৳3,800,000","Dakshin Kattali, 11 No. South Kattali Ward"
2674,An Apartment Is Up For Sale In Dakshin Kattali...,3.0,3.0,6,vacant,1250.0,chattogram,"৳3,800,000","Dakshin Kattali, 11 No. South Kattali Ward"
2674,An Apartment Is Up For Sale In Dakshin Kattali...,3.0,3.0,7,vacant,1250.0,chattogram,"৳3,800,000","Dakshin Kattali, 11 No. South Kattali Ward"
2674,An Apartment Is Up For Sale In Dakshin Kattali...,3.0,3.0,8,vacant,1250.0,chattogram,"৳3,800,000","Dakshin Kattali, 11 No. South Kattali Ward"

#### Moving to where we have character beside the floor number (eg; th, st, ect)

In [62]:
df_clean[df_clean["Floor_no"] == "8th"]

,Title,Bedrooms,Bathrooms,Floor_no,Occupancy_status,Floor_area,City,Price_in_taka,Location
34,An Apartment For Sale Is All Set For You To Se...,3.0,3.0,8th,vacant,1100.0,dhaka,"৳4,700,000","Dhaka Uddan, Mohammadpur"

In [63]:
df_clean[df_clean["Floor_no"] == "5th"]

,Title,Bedrooms,Bathrooms,Floor_no,Occupancy_status,Floor_area,City,Price_in_taka,Location
2126,Take This Residential Flat Is For Sale At Baya...,3.0,2.0,5th,vacant,1162.0,chattogram,"৳5,000,000","Chadra Nagar, Bayazid"

In [64]:
df_clean[df_clean["Floor_no"] == "1st"]

,Title,Bedrooms,Bathrooms,Floor_no,Occupancy_status,Floor_area,City,Price_in_taka,Location
741,Imagine A Spacious Flat That Comes With Your A...,4.0,5.0,1st,vacant,2380.0,dhaka,"৳29,000,000","Block D, Bashundhara R-A"

In [65]:
df_clean[df_clean["Floor_no"] == "1F"]

,Title,Bedrooms,Bathrooms,Floor_no,Occupancy_status,Floor_area,City,Price_in_taka,Location
1551,"At Bayazid, Flat For Sale Close To Bayazid Thana",3.0,3.0,1F,vacant,1313.0,chattogram,"৳6,500,000","Chadra Nagar, Bayazid"

#### I chose to simply remove the characters

In [66]:
df_clean["Floor_no"] = df_clean["Floor_no"].str.replace(r"th|st|F", "", regex=True)

#### Moving to where we have "G+7" & "0+7"

In [67]:
df_clean[(df_clean["Floor_no"] == "G+7") | (df_clean["Floor_no"] == "0+7")]

,Title,Bedrooms,Bathrooms,Floor_no,Occupancy_status,Floor_area,City,Price_in_taka,Location
217,19200 SQ FT Full-Building is now for sale in M...,46.0,10.0,G+7,vacant,19200.0,dhaka,"৳75,000,000","Section 1, Mirpur"
1458,A Residential Building Which Is Up For Sale At...,21.0,10.0,0+7,vacant,13300.0,chattogram,"৳105,000,000","Rose Valley Residential Area, 9 No. North Paha..."

#### We clearly see from the title that these are buildings, and i interpreted it as follow G+7 = Ground + 7floors, same goes for 0+7, i chose to replace G+7 and 0+7 by 8

In [68]:
df_clean["Floor_no"] = df_clean["Floor_no"].str.replace(r"G\+7|0\+7", "8", regex=True)

#### Moving to where we have "A1, A2, ..., A7"

In [69]:
df_clean[df_clean["Floor_no"] == "A1,A2,A3,A4,A5,A6,A7"]

,Title,Bedrooms,Bathrooms,Floor_no,Occupancy_status,Floor_area,City,Price_in_taka,Location
1104,A Full Building Is For Sale In Sugandha Reside...,18.0,10.0,"A1,A2,A3,A4,A5,A6,A7",vacant,10890.0,chattogram,"৳105,000,000","Sugandha Residential Area, Panchlaish"

#### We can see that this is a building containing 7apartments, i chose to replace it by 4floors, each floor contain 2apartment except for the last one that has only 1.

In [70]:
df_clean["Floor_no"] = df_clean["Floor_no"].str.replace("A1,A2,A3,A4,A5,A6,A7", "4")

#### Now after cleaning the column we can deal with the missing values

In [71]:
df_clean["Floor_no"].value_counts(dropna = False)

Floor_no
NaN    580
1      381
4      307
5      294
2      274
3      261
6      249
7      200
8      187
9      126
10      23
11      20
12      16
13       7
14       2
18       1
17       1
Name: count, dtype: int64

In [72]:
df_clean["Floor_no"] = df_clean["Floor_no"].astype("float")

In [73]:
df_clean.dtypes

Title                object
Bedrooms            float64
Bathrooms           float64
Floor_no            float64
Occupancy_status     object
Floor_area          float64
City                 object
Price_in_taka        object
Location             object
dtype: object

#### To clarify Floor_no (floor number) confusion i added a new field (Type of propertie for sale). Floor number can be missleading it might mean the floor number that the appartment exist in, or it can mean the number of floors in a building.
#### In order to create these columns i utilized the title column.

In [74]:
building_pattern = r"building|complex|condominium|residence"
apartment_pattern = r"apartment|flat|living space|apt.|duplex"
commercial_pattern = r"office|shop|retail|business|commercial space|warehouse|factory|store|business center|showroom|industrial space|market|plaza|outlet|commercial"
house_pattern = r"house|residential|cottage|bungalow|townhouse|family home|detached house|semi-detached house|ranch|estate|home"

In [75]:
# prompt: in the dataframe df_clean create a new column property_type. it will hold 'building','apartment','commercial','bungalow/townhouse' wherever building_pattern,apartment_pattern,commercial_pattern and house_pattern would be found in the title respectively

import re



# Create the 'property_type' column
df_clean['property_type'] = 'Unknown'

# Apply patterns to the 'title' column
df_clean.loc[df_clean['Title'].str.contains(building_pattern, flags=re.IGNORECASE, regex=True), 'property_type'] = 'building'
df_clean.loc[df_clean['Title'].str.contains(apartment_pattern, flags=re.IGNORECASE, regex=True), 'property_type'] = 'apartment'
df_clean.loc[df_clean['Title'].str.contains(commercial_pattern, flags=re.IGNORECASE, regex=True), 'property_type'] = 'commercial'
df_clean.loc[df_clean['Title'].str.contains(house_pattern, flags=re.IGNORECASE, regex=True), 'property_type'] = 'bungalow/townhouse'

In [76]:
df_clean['property_type'].value_counts()

property_type
apartment             1698
bungalow/townhouse     532
commercial             355
Unknown                292
building                52
Name: count, dtype: int64

In [77]:
df_clean[df_clean['property_type']=='Unknown'].head()

,Title,Bedrooms,Bathrooms,Floor_no,Occupancy_status,Floor_area,City,Price_in_taka,Location,property_type
137,"Live Permanently In A 1550 Sq Ft Property, Whi...",3.0,3.0,2.0,vacant,1550.0,dhaka,"৳14,500,000","Uttar Badda, Badda",Unknown
138,Ideal 8.08 Katha Plot For Sale In Gulshan 1,NaN,NaN,NaN,vacant,5824.0,dhaka,"৳300,000,000","Gulshan 1, Gulshan",Unknown
176,"In the location of Mirpur, very close to Medic...",2.0,2.0,5.0,vacant,800.0,dhaka,"৳3,700,000","Section 6, Mirpur",Unknown
560,Have A Look At This 1900 Sq Ft Property Which ...,4.0,4.0,9.0,vacant,1900.0,dhaka,"৳19,000,000","Block D, Bashundhara R-A",Unknown
612,3 Katha Plot is now available for sale in Purb...,NaN,NaN,NaN,vacant,2160.0,dhaka,"৳29,000,000","Sector 17, Purbachal",Unknown

we can see that there are lot of land properties so we can remove those since we are only working with housing

In [78]:
# prompt: remove rows where the Title contains ' Plot| plot| Katha| katha'

import pandas as pd
import re

# Assuming your DataFrame is named 'df_clean'
# Create a copy to avoid modifying the original DataFrame directly
df_cleaned = df_clean.copy()

# Define the pattern for the strings to remove
pattern = r"Plot|plot|Katha|katha"

# Use boolean indexing to filter out rows where 'Title' matches the pattern
df_cleaned = df_cleaned[~df_cleaned['Title'].str.contains(pattern, flags=re.IGNORECASE, regex=True)]

In [79]:
df_cleaned['property_type'].value_counts()

property_type
apartment             1695
bungalow/townhouse     383
commercial             347
building                44
Unknown                 15
Name: count, dtype: int64

In [80]:
df_cleaned[df_cleaned['property_type']=='Unknown']

,Title,Bedrooms,Bathrooms,Floor_no,Occupancy_status,Floor_area,City,Price_in_taka,Location,property_type
137,"Live Permanently In A 1550 Sq Ft Property, Whi...",3.0,3.0,2.0,vacant,1550.0,dhaka,"৳14,500,000","Uttar Badda, Badda",Unknown
176,"In the location of Mirpur, very close to Medic...",2.0,2.0,5.0,vacant,800.0,dhaka,"৳3,700,000","Section 6, Mirpur",Unknown
560,Have A Look At This 1900 Sq Ft Property Which ...,4.0,4.0,9.0,vacant,1900.0,dhaka,"৳19,000,000","Block D, Bashundhara R-A",Unknown
797,"Prominent Location And Splendid Outlook, This ...",NaN,NaN,2.0,vacant,1700.0,dhaka,"৳11,600,000","East Monipur, Mirpur",Unknown
802,Have A Look At This 1100 Sq Ft Property Which ...,3.0,3.0,9.0,vacant,1100.0,dhaka,"৳6,500,000","Section 12, Mirpur",Unknown
1278,Convenient 1222 Sq Ft Is Now For Sale In Kadam...,3.0,3.0,5.0,vacant,1222.0,chattogram,"৳4,888,000","23 No. North Pathantooly Ward, Double Mooring",Unknown
1306,Buy This 1650 Sq Ft Fat In 15 No. Bagmoniram W...,3.0,4.0,3.0,vacant,1650.0,chattogram,"৳12,000,000","Nasirabad, 15 No. Bagmoniram Ward",Unknown
1367,test listing ma 24.6:2,NaN,NaN,NaN,NaN,NaN,chattogram,"৳54,235",NaN,Unknown
1368,test listing ma 22.6:2,NaN,NaN,NaN,NaN,NaN,chattogram,"৳6,669",NaN,Unknown
1406,tesdt 2,NaN,NaN,NaN,NaN,NaN,chattogram,৳66,NaN,Unknown
1641,Have A Look At This 1253 Sq Ft Property Which ...,3.0,3.0,2.0,vacant,1253.0,chattogram,"৳5,638,500","Dewan Bazar, Bakalia",Unknown
1950,Persuade This Serene Locality To Live In While...,3.0,3.0,5.0,vacant,1615.0,chattogram,"৳11,500,000","Jamal Khan By-Lane, Jamal Khan",Unknown
2063,test lsitin ma,NaN,NaN,NaN,NaN,NaN,chattogram,"৳434,434",NaN,Unknown
2068,test listing ma 21.6:8,NaN,NaN,NaN,NaN,NaN,chattogram,৳566,NaN,Unknown
2081,Have A Look At This 1304 Sq Ft Property Which ...,3.0,3.0,7.0,vacant,1304.0,chattogram,"৳5,998,400","Ishan Mohajon Road, 10 No. North Kattali Ward",Unknown

for the other rows we can consider the properties to be apartments

In [82]:
# prompt: for the rows that have 'Unknown' in the property_type column replace those with 'apartment' on property_type

# Replace 'Unknown' values in 'property_type' with 'apartment'
df_cleaned.loc[df_cleaned['property_type'] == 'Unknown', 'property_type'] = 'apartment'

In [83]:
df_cleaned['property_type'].value_counts()

property_type
apartment             1710
bungalow/townhouse     383
commercial             347
building                44
Name: count, dtype: int64

In [84]:
df_cleaned['City'].value_counts()

City
chattogram          1151
dhaka               1042
gazipur              148
cumilla              137
narayanganj-city       6
Name: count, dtype: int64

In [85]:
df_clean=df_cleaned.copy()

In [86]:
# prompt: replace the values in the City column
#  "chattogram": "Chattogram_city",
#                                       "cumilla": "Cumilla_city",
#                                       "dhaka": "Dhaka_city",
#                                       "narayanganj-city": "Narayanganj_city",
#                                       "gazipur": "Gazipur_city"

# Replace values in the 'City' column
city_mapping = {
    "chattogram": "Chattogram_city",
    "cumilla": "Cumilla_city",
    "dhaka": "Dhaka_city",
    "narayanganj-city": "Narayanganj_city",
    "gazipur": "Gazipur_city"
}

df_clean['City'] = df_clean['City'].replace(city_mapping)

In [87]:
df_clean.head()

,Title,Bedrooms,Bathrooms,Floor_no,Occupancy_status,Floor_area,City,Price_in_taka,Location,property_type
0,We Are Offering You A Very Spacious 1960 Sq Ft...,3.0,4.0,3.0,vacant,1960.0,Dhaka_city,"৳39,000,000","Gulshan 1, Gulshan",apartment
1,Valuable 1705 Square Feet Apartment Is Ready T...,3.0,3.0,1.0,vacant,1705.0,Dhaka_city,"৳16,900,000","Lake Circus Road, Kalabagan",apartment
2,1370 square feet apartment is ready to sale in...,3.0,3.0,6.0,vacant,1370.0,Dhaka_city,"৳12,500,000","Shukrabad, Dhanmondi",apartment
3,2125 Square Feet Apartment For Sale In Bashund...,3.0,3.0,4.0,vacant,2125.0,Dhaka_city,"৳20,000,000","Block L, Bashundhara R-A",apartment
4,Buy This 2687 Square Feet Flat In The Nice Are...,3.0,3.0,4.0,vacant,2687.0,Dhaka_city,"৳47,500,000","Road No 25, Banani",apartment

In [88]:
#pd.set_option('display.max_colwidth', None)
#pd.reset_option('display.max_colwidth')

### Missing values of bedrooms, bathrooms and floor number columns

#### We have 18 floor_no and we have building , appartment , house and commercial. Now i calculated median for each floor_no for building, appartment, house, and for commercial. After that i used these medians that we calculated to fill missing values of bedrooms and bathrooms in each 18floor_no and each property type (building apprtement house and commercial)

In [89]:
df_clean[['Bedrooms','Floor_no','Bathrooms']].isna().sum()

Bedrooms     386
Floor_no     144
Bathrooms    386
dtype: int64

In [90]:
# prompt: find number of rows that have 'building' in the property_type and missing values on Bedrooms,Bathrooms

# Assuming 'df_clean' is your DataFrame as defined in the provided code.

# Find rows where 'property_type' is 'building' and 'Bedrooms' or 'Bathrooms' are missing.
missing_bedrooms_bathrooms_buildings = df_clean[
    (df_clean['property_type'] == 'building') &
    (df_clean['Bedrooms'].isna() | df_clean['Bathrooms'].isna())
]
missing_bedrooms_bathrooms_apartments = df_clean[
    (df_clean['property_type'] == 'apartment') &
    (df_clean['Bedrooms'].isna() | df_clean['Bathrooms'].isna())
]
missing_bedrooms_bathrooms_commercial = df_clean[
    (df_clean['property_type'] == 'commercial') &
    (df_clean['Bedrooms'].isna() | df_clean['Bathrooms'].isna())
]
missing_bedrooms_bathrooms_bungalow = df_clean[
    (df_clean['property_type'] == 'bungalow/townhouse') &
    (df_clean['Bedrooms'].isna() | df_clean['Bathrooms'].isna())
]


num_rows_missing_building = len(missing_bedrooms_bathrooms_buildings)
num_rows_missing_commercial = len(missing_bedrooms_bathrooms_commercial)
num_rows_missing_apartment = len(missing_bedrooms_bathrooms_apartments)
num_rows_missing_bungalow = len(missing_bedrooms_bathrooms_bungalow)
print(f"Number of rows with 'building' property type and missing Bedrooms or Bathrooms: {num_rows_missing_building}")
print(f"Number of rows with 'commercial' property type and missing Bedrooms or Bathrooms: {num_rows_missing_commercial}")
print(f"Number of rows with 'apartment' property type and missing Bedrooms or Bathrooms: {num_rows_missing_apartment}")
print(f"Number of rows with 'bungalow' property type and missing Bedrooms or Bathrooms: {num_rows_missing_bungalow}")

Number of rows with 'building' property type and missing Bedrooms or Bathrooms: 3
Number of rows with 'commercial' property type and missing Bedrooms or Bathrooms: 321
Number of rows with 'apartment' property type and missing Bedrooms or Bathrooms: 48
Number of rows with 'bungalow' property type and missing Bedrooms or Bathrooms: 14

commercial properties do not contain bedroom and bathroom like residential homes. hence a lot of those are empty. so for commercial properties I will keep the number of bathrooms and bedrooms 0 because in case of commercial Floor_area matters most

In [91]:
# prompt: in rows where property_type is 'commercial', fill the missing columns of 'Bathrooms' and 'Bedrooms' with 0

# Fill missing 'Bathrooms' and 'Bedrooms' with 0 for 'commercial' property type
df_clean.loc[df_clean['property_type'] == 'commercial', ['Bathrooms', 'Bedrooms']] = df_clean.loc[df_clean['property_type'] == 'commercial', ['Bathrooms', 'Bedrooms']].fillna(0)

I will fill up the bathrooms with median values for other cases

In [92]:
# Create dictionaries to hold median floor numbers
median_bathroom_no = {
    "building": None,
    "apartment": None,
    "bungalow/townhouse": None
}

# Calculate median floor_no for each property type
for property_type in ["building", "apartment", "bungalow/townhouse"]:
    sub_df = df_clean[df_clean['property_type'] == property_type]
    median_bathroom_no[property_type] = sub_df["Bathrooms"].median()

In [93]:
median_bathroom_no

{'building': 3.0, 'apartment': 3.0, 'bungalow/townhouse': 3.0}

In [94]:
# Create dictionaries to hold median floor numbers
median_bedroom_no = {
    "building": None,
    "apartment": None,
    "bungalow/townhouse": None
}

# Calculate median floor_no for each property type
for property_type in ["building", "apartment", "bungalow/townhouse"]:
    sub_df = df_clean[df_clean['property_type'] == property_type]
    median_bedroom_no[property_type] = sub_df["Bedrooms"].median()

In [95]:
median_bedroom_no

{'building': 3.0, 'apartment': 3.0, 'bungalow/townhouse': 3.0}

#### Median of floor number

In [96]:
# Create dictionaries to hold median floor numbers
median_floor_no = {
    "building": None,
    "apartment": None,
    "bungalow/townhouse": None,
    "commercial": None
}

# Calculate median floor_no for each property type
for property_type in ["building", "apartment", "bungalow/townhouse",'commercial']:
    sub_df = df_clean[df_clean['property_type'] == property_type]
    median_floor_no[property_type] = sub_df["Floor_no"].median()

In [97]:
median_floor_no

{'building': 5.0,
 'apartment': 5.0,
 'bungalow/townhouse': 4.0,
 'commercial': 3.0}

fill up the missing values of 'Floor_no' 'Bathrooms' and 'Bedrooms' based on the median values found

In [98]:
# prompt: fill up the missing values of 'Floor_no' 'Bathrooms' and 'Bedrooms' based on the median values found

# Fill missing 'Floor_no' based on the median for each property type
for property_type in median_floor_no:
    df_clean.loc[(df_clean['Floor_no'].isna()) & (df_clean['property_type'] == property_type), 'Floor_no'] = median_floor_no[property_type]

# Fill missing 'Bathrooms' based on the median for each property type
for property_type in median_bathroom_no:

    df_clean.loc[(df_clean['Bathrooms'].isna()) & (df_clean['property_type'] == property_type), 'Bathrooms'] = median_bathroom_no[property_type]

# Fill missing 'Bedrooms' based on the median for each property type
for property_type in median_bedroom_no:
    df_clean.loc[(df_clean['Bedrooms'].isna()) & (df_clean['property_type'] == property_type), 'Bedrooms'] = median_bedroom_no[property_type]

**Missing** **Floor_area**

In [120]:
df_copy['Floor_area'].isna().sum()

'Choose your destination at 1500 SQ FT flat which is available for sale in North Shahjahanpur near to Pubali Bank.'

we can find the Floor_area from the title

In [122]:
# prompt: for missing 'Floor_area' from the Title.lower() get the number which is followed by 'sq'
df_copy=df_clean.copy()
import re

def extract_floor_area(title):
  """
  Extracts floor area from a title string.

  Args:
    title: The title string to search.

  Returns:
    The extracted floor area as a float, or None if not found.
  """
  match = re.search(r"(\d+)\s*sq", title.lower())
  if match:
    return float(match.group(1))
  return None


# Example usage (assuming df_clean is your DataFrame)

df_copy.loc[df_copy['Floor_area'].isna(), 'Floor_area'] = df_copy.loc[df_copy['Floor_area'].isna(), 'Title'].apply(extract_floor_area)
  #df_copy.loc[i, 'Floor_area'] = extract_floor_area(df_copy.loc[i, 'Title'])
#df_clean['extracted_floor_area'] = df_clean['Title'].apply(extract_floor_area)

# Now you can use the 'extracted_floor_area' column to fill missing values in 'Floor_area'
# Example: Fill missing values in 'Floor_area' with values from 'extracted_floor_area'

In [127]:
df_copy['Floor_area'].isna().sum()

0

for the rest of the Floor_area we can fill the median value

In [125]:
df_clean=df_copy.copy()
median_floor_area = {
    "building": None,
    "apartment": None,
    "bungalow/townhouse": None,
    "commercial": None
}

# Calculate median floor_no for each property type
for property_type in ["building", "apartment", "bungalow/townhouse",'commercial']:
    sub_df = df_clean[df_clean['property_type'] == property_type]
    median_floor_area[property_type] = sub_df["Floor_area"].median()
for property_type in median_floor_area:
    df_clean.loc[(df_clean['Floor_area'].isna()) & (df_clean['property_type'] == property_type), 'Floor_area'] = median_floor_area[property_type]

for Occupancy_status we can assume that those rows that are empty are vacant

In [138]:
df_clean.loc[df_clean['Occupancy_status'].isna(),'Occupancy_status']='vacant'

#### Our data set after filling the 3columns with their respective medians

In [139]:
df_clean.isna().sum()

Title               0
Bedrooms            0
Bathrooms           0
Floor_no            0
Occupancy_status    0
Floor_area          0
City                0
Price_in_taka       0
Location            6
property_type       0
dtype: int64

In [140]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2484 entries, 0 to 2928
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Title             2484 non-null   object
 1   Bedrooms          2484 non-null   float64
 2   Bathrooms         2484 non-null   float64
 3   Floor_no          2484 non-null   float64
 4   Occupancy_status  2484 non-null   object
 5   Floor_area        2484 non-null   float64
 6   City              2484 non-null   object
 7   Price_in_taka     2484 non-null   object
 8   Location          2478 non-null   object
 9   property_type     2484 non-null   object
dtypes: float64(4), object(6)
memory usage: 278.0+ KB

#### Data set

#### Fixing Location missing value

In [141]:
df_clean[df_clean["Location"].isna()]

,Title,Bedrooms,Bathrooms,Floor_no,Occupancy_status,Floor_area,City,Price_in_taka,Location,property_type
383,1254 Sq Ft Flat For Sale In Kalachandpur,3.0,3.0,6.0,vacant,1254.0,Dhaka_city,"৳8,300,000",NaN,apartment
1367,test listing ma 24.6:2,3.0,3.0,5.0,vacant,1350.0,Chattogram_city,"৳54,235",NaN,apartment
1368,test listing ma 22.6:2,3.0,3.0,5.0,vacant,1350.0,Chattogram_city,"৳6,669",NaN,apartment
1406,tesdt 2,3.0,3.0,5.0,vacant,1350.0,Chattogram_city,৳66,NaN,apartment
2063,test lsitin ma,3.0,3.0,5.0,vacant,1350.0,Chattogram_city,"৳434,434",NaN,apartment
2068,test listing ma 21.6:8,3.0,3.0,5.0,vacant,1350.0,Chattogram_city,৳566,NaN,apartment

#### We can see from the title the location of this property

In [142]:
df_clean.loc[383, "Location"] = "Kalachandpur"

drop all other rows

In [144]:
df_clean=df_clean.dropna()

converting the Price_in_taka column to float

In [147]:
df_clean['Price_in_taka']=df_clean['Price_in_taka'].replace({'\৳': '', ',': ''}, regex=True).astype(float)

making new columns "Area" and "Section/Block" which will have the name of the place. we will take rows that have 
one comma and split those two. Also replacing all 'sector' with 'section'

In [150]:
df_clean['Location'].str.count(',').value_counts()

Location
1    2460
0      18
2       1
Name: count, dtype: int64

In [184]:
df_copy=df_clean.copy()

In [192]:
df_copy['Area'].value_counts().head(10)

Area
mirpur                        408
gazipur sadar upazila         146
9 no. north pahartali ward    140
double mooring                133
bakalia                       129
bashundhara r-a               117
bayazid                       100
4 no chandgaon ward            92
khulshi                        79
uttara                         77
Name: count, dtype: int64

In [191]:
df_copy=df_copy.dropna()